![png](books_db.png)

## Part 2: Create the database in Python

In [10]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
password = quote_plus("Bmm@3950550")
connection_str = f"mysql+pymysql://root:{password}@localhost/books"

In [11]:
engine = create_engine(connection_str)

In [12]:
create_database(connection_str)

In [13]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [14]:
import pandas as pd
df_2 = pd.read_csv("../Data/data-2.csv")
df_2.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [17]:
df_2.to_sql('users', engine)

3

In [16]:
df_3 = pd.read_csv("../Data/data-3.csv")
df_3.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [18]:
df_3.to_sql('books', engine)

6

In [19]:
df_4 = pd.read_csv("../Data/data-4.csv")
df_4.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [20]:
df_4.to_sql('authors', engine)

5

In [21]:
df_5 = pd.read_csv("../Data/data-5.csv")
df_5.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [22]:
df_5.to_sql('favorites', engine)

7

In [23]:
q = """ SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
 """
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1